In [1]:
import numpy as np
import pandas as pd

In [4]:
df=pd.DataFrame([
                [10,15,11,12],
              [45,66,23,14],
              [22,33,44,55],
              [78,88,96,45]],
            columns=['oas','java','se','ds'])
df

   oas  java  se  ds
0   10    15  11  12
1   45    66  23  14
2   22    33  44  55
3   78    88  96  45

In [5]:
df.describe()

             oas       java        se         ds
count   4.000000   4.000000   4.00000   4.000000
mean   38.750000  50.500000  43.50000  31.500000
std    29.926298  32.726136  37.56328  21.763884
min    10.000000  15.000000  11.00000  12.000000
25%    19.000000  28.500000  20.00000  13.500000
50%    33.500000  49.500000  33.50000  29.500000
75%    53.250000  71.500000  57.00000  47.500000
max    78.000000  88.000000  96.00000  55.000000

In [6]:
df.sum()

oas     155
java    202
se      174
ds      126
dtype: int64

In [7]:
df.max()

oas     78
java    88
se      96
ds      55
dtype: int64

In [9]:
df.min()

oas     10
java    15
se      11
ds      12
dtype: int64

In [10]:
df.mean()

oas     38.75
java    50.50
se      43.50
ds      31.50
dtype: float64

In [11]:
df.count()

oas     4
java    4
se      4
ds      4
dtype: int64

In [12]:
df.median()

oas     33.5
java    49.5
se      33.5
ds      29.5
dtype: float64

In [13]:
df.agg(['sum','min','max'])

     oas  java   se   ds
sum  155   202  174  126
min   10    15   11   12
max   78    88   96   55

In [23]:
from pandas import DataFrame
df = DataFrame(
              [
                ['Aryan','Singh','Full-time','administration',2,2000],
                ['Rohan','Agarval','intern','technical',3,5000],
                ['Riya','Shah','Full-time','administration',5,10000],
                ['Yash','Bhatia','Part-time','technical',7,10000],
                ['Siddant','Khanna','Full-time','Management',6,20000],
              ]
            , columns=['FIRST NAME','LAST NAME','TYPE','DEPARTMENT','YOE','SALARY']
              )
df

  FIRST NAME LAST NAME       TYPE      DEPARTMENT  YOE  SALARY
0      Aryan     Singh  Full-time  administration    2    2000
1      Rohan   Agarval     intern       technical    3    5000
2       Riya      Shah  Full-time  administration    5   10000
3       Yash    Bhatia  Part-time       technical    7   10000
4    Siddant    Khanna  Full-time      Management    6   20000

In [26]:
df.groupby(['TYPE']).mean()

                YOE        SALARY
TYPE
Full-time  4.333333  10666.666667
Part-time  7.000000  10000.000000
intern     3.000000   5000.000000

In [27]:
df.groupby(['TYPE']).min()

          FIRST NAME LAST NAME  DEPARTMENT  YOE  SALARY
TYPE
Full-time      Aryan    Khanna  Management    2    2000
Part-time       Yash    Bhatia   technical    7   10000
intern         Rohan   Agarval   technical    3    5000

In [28]:
df.groupby(['TYPE','DEPARTMENT']).mean()

                          YOE   SALARY
TYPE      DEPARTMENT
Full-time Management      6.0  20000.0
          administration  3.5   6000.0
Part-time technical       7.0  10000.0
intern    technical       3.0   5000.0

In [30]:
df.groupby(['TYPE','DEPARTMENT']).min()

                         FIRST NAME LAST NAME  YOE  SALARY
TYPE      DEPARTMENT
Full-time Management        Siddant    Khanna    6   20000
          administration      Aryan      Shah    2    2000
Part-time technical            Yash    Bhatia    7   10000
intern    technical           Rohan   Agarval    3    5000